InformationRegisters/СвязанныеОбъектыРаспознаниеДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.11">
	<InformationRegister>
		<Properties>
			<Name>СвязанныеОбъектыРаспознаниеДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УдалитьРаспознанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспознанныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ОтображатьНаФорме</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПотенциальныйКандидат</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументыСоздаваемыеИзРаспознанногоДокументаБРД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РаспознанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспознанныйДокумент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СвязанныеОбъектыРаспознаниеДокументов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт
	
	Ограничение.Текст =
	"РазрешитьЧтение
	|ГДЕ
	|	ЧтениеОбъектаРазрешено(СсылкаНаОбъект)
	|	И ЧтениеОбъектаРазрешено(РаспознанныйДокумент)
	|;
	|РазрешитьИзменениеЕслиРазрешеноЧтение
	|ГДЕ
	|	ИзменениеОбъектаРазрешено(СсылкаНаОбъект)
	|	И ИзменениеОбъектаРазрешено(РаспознанныйДокумент)";
	
КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСвязанныеДокументы(РаспознанныйДокумент, ВключатьПотенциальные = Ложь) Экспорт
	
	ТекстЗапроса =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект КАК СсылкаНаОбъект
		|ИЗ
		|	РегистрСведений.СвязанныеОбъектыРаспознаниеДокументов КАК СвязанныеОбъектыРаспознаниеДокументов
		|ГДЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.РаспознанныйДокумент = &РаспознанныйДокумент
		|	И НЕ СвязанныеОбъектыРаспознаниеДокументов.ПотенциальныйКандидат";
	
	Если ВключатьПотенциальные Тогда
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НЕ СвязанныеОбъектыРаспознаниеДокументов.ПотенциальныйКандидат", "ИСТИНА");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = ТекстЗапроса;
	
	Запрос.УстановитьПараметр("РаспознанныйДокумент", РаспознанныйДокумент);
	
	Выборка = Запрос.Выполнить();
	Если Выборка.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;
	
	РезультатЗапроса = Выборка.Выгрузить();
	
	Возврат РезультатЗапроса.ВыгрузитьКолонку("СсылкаНаОбъект");
	
КонецФункции

Функция ВсеСвязанныеДокументы(РаспознанныйДокумент) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект КАК Ссылка,
		|	СвязанныеОбъектыРаспознаниеДокументов.ПотенциальныйКандидат КАК ПотенциальныйКандидат
		|ИЗ
		|	РегистрСведений.СвязанныеОбъектыРаспознаниеДокументов КАК СвязанныеОбъектыРаспознаниеДокументов
		|ГДЕ
		|	СвязанныеОбъектыРаспознаниеДокументов.РаспознанныйДокумент = &РаспознанныйДокумент
		|	И НЕ СвязанныеОбъектыРаспознаниеДокументов.СсылкаНаОбъект.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("РаспознанныйДокумент", РаспознанныйДокумент);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

Процедура ЗаписатьЗначения(СозданныйДокумент, РаспознанныйДокумент, ПотенциальныйКандидат = Истина) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.СсылкаНаОбъект = СозданныйДокумент;
	Запись.РаспознанныйДокумент = РаспознанныйДокумент;
	Запись.ПотенциальныйКандидат = ПотенциальныйКандидат;
	Запись.Записать();
	
КонецПроцедуры

Процедура УдалитьЗначения(СозданныйДокумент, РаспознанныйДокумент) Экспорт
	
	Запись = СоздатьМенеджерЗаписи();
	Запись.СсылкаНаОбъект = СозданныйДокумент;
	Запись.РаспознанныйДокумент = РаспознанныйДокумент;
	Запись.Удалить();
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
